app/controllers/comments_controller.rb

  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.new(params[:comment].permit(:title, :body))
    @comment.user_id = current_user.id

    if @comment.save
---
SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 2 LIMIT 1
INSERT INTO `comments` (`title`, `body`, `post_id`, `user_id`, `created_at`, `updated_at`) VALUES ('Coucou', 'Autre coucou', 2, 1, '2016-05-02 06:14:03', '2016-05-02 06:14:03')