app/controllers/posts_controller.rb

SELECT  `posts`.* FROM `posts`  ORDER BY created_at DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `posts`
---
  def index
    # Charge les posts,
    # trié par date de création
    # par ordre ascendant
    # @posts = Post.all.order('created_at DESC')
    @posts = Post.order('created_at DESC').page(params[:page]).per(5)

INSERT INTO `posts` (`title`, `body`, `user_id`, `created_at`, `updated_at`) VALUES ('Test123', 'dadzadz', 1, '2016-05-02 06:45:12', '2016-05-02 06:45:12')
---
  def create
    @post = Post.new(post_params)
    @post.user_id = current_user.id

    if @post.save

SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 2 LIMIT 1
---
  def show
    # Récupération du post avec l'id passé en paramétre
    @post = Post.find(params[:id])

SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 2 LIMIT 1
UPDATE `posts` SET `body` = 'Coucou\r\nAutre coucou', `updated_at` = '2016-05-02 06:15:57' WHERE `posts`.`id` = 2
---
  def update
    @post = Post.find(params[:id])

    if @post.update(params[:post].permit(:title, :body))